app/library/header.php

    public static function header() {
        $id = session()->get('id');
        $loginuser = \DB::table('user')->where('sessionid', $id)->first();
---
select * from `user` where `sessionid` = 2 limit 1

    public static function look_myuser() {
        $id = session()->get('id');
        $loginuser = \DB::table('user')->where('sessionid', $id)->first();
---
select * from `user` where `sessionid` is null limit 1

    public static function look_youruser($userid) {
        $loginuser = \DB::table('user')->where('userid', $userid)->first();
---
select * from `user` where `userid` = 1309134703 limit 1