app/Http/Controllers/ChatController.php

     public function chat (Request  $request)
     {
         list($name,$fileName,$myid) = BaseClass::look_myuser();
         // チャット一覧
         $chatrooms =  \DB::table('chat')
         ->leftjoin('community','chat.chatroom','=','community.groupid')
         ->leftjoin('user','chat.reply_id','=','user.userid')
         ->select('chat.chatroom','user.name as user_name','user.image as user_image','community.image as community_image','community.name as community_name')
         ->where('chat.user_id',$myid)->whereNull('message')->distinct()->get();
---
select distinct `chat`.`chatroom`, `user`.`name` as `user_name`, `user`.`image` as `user_image`, `community`.`image` as `community_image`, `community`.`name` as `community_name` from `chat` left join `community` on `chat`.`chatroom` = `community`.`groupid` left join `user` on `chat`.`reply_id` = `user`.`userid` where `chat`.`user_id` = 2034178332 and `message` is null

     public function talkroom (Request  $request,$chatroomid)
     {
         list($name,$fileName,$myid) = BaseClass::look_myuser();
         // 相手の情報
         $groupinfo =  \DB::table('chat')
         ->leftjoin('community','chat.chatroom','=','community.groupid')
         ->leftjoin('user','chat.user_id','=','user.userid')
         ->select('user.name as user_name','user.image as user_image','community.image as community_image','community.name as community_name')
         ->where('chat.chatroom',$chatroomid)->first();

         if(!isset($groupinfo->community_name))
         {
             $yourinfo = \DB::table('chat')
             ->leftjoin('user','chat.reply_id','=','user.userid')
             ->select('user.name as name','user.image as image')
             ->where('chat.chatroom',$chatroomid)->where('chat.user_id',$myid)->first();
---
select `user`.`name` as `user_name`, `user`.`image` as `user_image`, `community`.`image` as `community_image`, `community`.`name` as `community_name` from `chat` left join `community` on `chat`.`chatroom` = `community`.`groupid` left join `user` on `chat`.`user_id` = `user`.`userid` where `chat`.`chatroom` = '948926470' limit 1
select `user`.`name` as `name`, `user`.`image` as `image` from `chat` left join `user` on `chat`.`reply_id` = `user`.`userid` where `chat`.`chatroom` = '948926470' and `chat`.`user_id` = 2034178332 limit 1

     public function chatajax (Request  $request,$chatroomid)
     {
         list($name,$fileName,$myid) = BaseClass::look_myuser();
         // 相手の情報を取得
         $chatroomtalk =  \DB::table('chat')
         ->leftjoin('community','chat.chatroom','=','community.groupid')
         ->leftjoin('user','chat.user_id','=','user.userid')
         ->select('chat.chatroom','chat.id as id','user.name as user_name','user.userid as user_id','user.image as user_image','community.image as community_image','community.name as community_name','chat.message as message')
         ->where('chat.chatroom',$chatroomid)->whereNotNull('message')->orderBy('id', 'asc')->distinct()->get();
---
select distinct `chat`.`chatroom`, `chat`.`id` as `id`, `user`.`name` as `user_name`, `user`.`userid` as `user_id`, `user`.`image` as `user_image`, `community`.`image` as `community_image`, `community`.`name` as `community_name`, `chat`.`message` as `message` from `chat` left join `community` on `chat`.`chatroom` = `community`.`groupid` left join `user` on `chat`.`user_id` = `user`.`userid` where `chat`.`chatroom` = '688107663' and `message` is not null order by `id` asc