app/Http/Controllers/GroupController.php

select distinct * from `community` where `user_id` = 2034178332
select distinct `groupid`, `name`, `image` from `community` where `user_id` <> 2034178332
---
    public function community (Request  $request)
    {
        list($name,$fileName,$myid) = BaseClass::look_myuser();
        if(isset($request->community_name))
        {
            // コミュニティ作成
            $community = new Community;
            $community->groupid = rand();
            $community->user_id= $myid;
            $community->member = 1;
            $community->name = $request->community_name;
            $file = $request->file('image');
            if($file->isValid()) {
                $fileNames = time() . $file->getClientOriginalName();
                $target_path = public_path('uploads');
                $file->move($target_path, $fileNames);
            }
            $community->image = $fileNames;
            $community->category = $request->community_category;
            $community->save();
        }
        // 自分のグループ
        $my_community =  \App\Models\Community::where('user_id', $myid)->distinct()->get();
        // 自分以外のグループ
        $communities =  \DB::table('community')
        ->select('groupid','name','image')
        ->where('user_id','<>', $myid)->distinct()->get();

select * from `community` where `groupid` = '1777269087' order by `created_at` desc limit 1
select * from `community` where `groupid` = '1777269087' and `user_id` = 2034178332 limit 1
select * from `community` inner join `user` on `community`.`user_id` = `user`.`userid` where `community`.`groupid` = '1777269087'
---
    public function communitydetail (Request  $request,$groupid)
    {
        list($name,$fileName,$myid) = BaseClass::look_myuser();
        // グループ情報
        $communities =  \App\Models\Community::where('groupid', $groupid)->latest()->first();
        // 自分が入っているかどうか
        $mygroupjoin =  \App\Models\Community::where('groupid', $groupid)->where('user_id', $myid)->first();
        // メンバー
        $communitymember =  \DB::table('community')
        ->join('user','community.user_id','=','user.userid')
        ->where('community.groupid',$groupid)->get();

select distinct * from `community` where `name` LIKE '%プログラミング%' and `user_id` <> 2034178332
---
    public function search (Request  $request)
    {
        list($name,$fileName,$myid) = BaseClass::look_myuser();

        $keyword = $request->community_search;

        $query = Community::query();

        if(!empty($keyword)){
            $query->where('name', 'LIKE', "%{$keyword}%")
            ->where('user_id','<>', $myid);
        }
        $lookgroup = $query->distinct()->get();