app/Http/Controllers/NewuserController.php

    public function start (Request  $request)
    {
        // アップロード
        $id = session()->get('id');
        $item = test::find($id);
        $user =  \DB::table('user')->where('sessionid', $id)->first();
---
select * from `user` where `sessionid` = 75 limit 1