app/Http/Controllers/PersonController.php

    public function  login(Request $request)
    {
        // ログインチェック
        if(Auth::check()) {
            $id = session()->get('id');
            $user =  \DB::table('user')->where('sessionid', $id)->first();
            $name= $user->name;
            $fileName= $user->image;
            $userid = $user->userid;
            $item = test::find($id);
            return view('person.mypage',compact('name','item','userid','fileName'));
        }
        else
        {
            $email = $request->login_mail;
            $password = $request->login_pass;
            // アカウントチェック
            if(Auth::attempt(['password' => $password, 'email' => $email])) {
                if(session()->exists('id')) {
                    $user =  \DB::table('user')->where('email', $email)->first();
                    $id = session()->get('id');
                }
                else
                {
                    $user =  \DB::table('user')->where('email', $email)->first();
---
select * from `user` where `email` = 'naokiokane@icloud.com' limit 1