app/Http/Controllers/PersonController.php

    public function insert(PostRequest  $result)
    {
        $insert=$result::all();
        if(Auth::check()) {
            // すでにログインしているユーザー
            if(isset($insert['userid']))
            {
                $youid = $insert['userid'];
                $youruser =  \DB::table('user')->where('userid', $youid)->first();
                $id = $youruser->sessionid;
            }
            else
            {
                $id = session()->get('id');
            }
            $user =  \DB::table('test')->where('id', $id)->first();
---
select * from `test` where `id` = 2 limit 1

            if(isset($insert['kind']))  {
                $test = new test;
                $test->kind = $sum;
                $test->save();

                $user = DB::table('test')->latest()->first();
---
insert into `test` (`kind`, `updated_at`, `created_at`) values (9, '2020-12-17 02:03:24', '2020-12-17 02:03:24')
select * from `test` order by `created_at` desc limit 1


            if(isset($insert['serious']))  {
                $id = session()->get('id');
                \DB::table('test')->where('id', $id) ->update([
                    'conscientiousness' => $sum
                ]);
---
update `test` set `conscientiousness` = 0 where `id` = 65


            if(isset($insert['openness']))  {
                $id = session()->get('id');
                \DB::table('test')->where('id', $id) ->update([
                    'openness' => $sum
                ]);
---
update `test` set `openness` = 0 where `id` = 55

    public function result (PostRequest  $request)
    {
        $user = DB::table('test')->latest()->first();
---
select * from `test` order by `created_at` desc limit 1

    public function  login(Request $request)
    {
        // ログインチェック
        if(Auth::check()) {
            $id = session()->get('id');
            $user =  \DB::table('user')->where('sessionid', $id)->first();
            $name= $user->name;
            $fileName= $user->image;
            $userid = $user->userid;
            $item = test::find($id);
            return view('person.mypage',compact('name','item','userid','fileName'));
        }
        else
        {
            if(isset($request->login_name))
            {
                $id = session()->get('id');
                $loginuser = new loginuser;
                $loginuser->userid = rand();
                $loginuser->sessionid = $id;
                $loginuser->name = $request->login_name;
                $loginuser->password = Hash::make($request->login_pass);
                $loginuser->email = $request->login_mail;
                $loginuser->save();
---
insert into `user` (`userid`, `sessionid`, `name`, `password`, `email`, `updated_at`, `created_at`) values (602509067, '', 'kiki', 'y$iB..7nE5ppFlApmZkDmV2eVImpjZlf3lxQCYT.VQwn/4Ia2wU4zBK', 'kiki@icloud.com', '2020-12-12 11:30:31', '2020-12-12 11:30:31')

                if(session()->exists('id')) {
                    session()->flush();
                }
                $user =  \DB::table('user')->where('email', $email)->first();
---
select * from `user` where `email` = 'naokiokane@icloud.com' limit 1

    public function chat (Request  $request)
    {
        list($name,$fileName,$myid) = BaseClass::look_myuser();
        // チャット一覧
        $chatrooms =  \DB::table('chat')
        ->leftjoin('community','chat.chatroom','=','community.groupid')
        ->leftjoin('user','chat.reply_id','=','user.userid')
        ->select('chat.chatroom','user.name as user_name','user.image as user_image','community.image as community_image','community.name as community_name')
        ->where('chat.user_id',$myid)->whereNull('message')->distinct()->get();
---
select `user`.`name` as `user_name`, `user`.`image` as `user_image`, `community`.`image` as `community_image`, `community`.`name` as `community_name` from `chat` left join `community` on `chat`.`chatroom` = `community`.`groupid` left join `user` on `chat`.`user_id` = `user`.`userid` where `chat`.`chatroom` = '1777269087' limit 1

    public function talkroom (Request  $request,$chatroomid)
    {
        list($name,$fileName,$myid) = BaseClass::look_myuser();
        // 相手の情報
        $groupinfo =  \DB::table('chat')
        ->leftjoin('community','chat.chatroom','=','community.groupid')
        ->leftjoin('user','chat.user_id','=','user.userid')
        ->select('user.name as user_name','user.image as user_image','community.image as community_image','community.name as community_name')
        ->where('chat.chatroom',$chatroomid)->first();
---
select `user`.`name` as `user_name`, `user`.`image` as `user_image`, `community`.`image` as `community_image`, `community`.`name` as `community_name` from `chat` left join `community` on `chat`.`chatroom` = `community`.`groupid` left join `user` on `chat`.`user_id` = `user`.`userid` where `chat`.`chatroom` = '1445300679' limit 1

    public function chatajax (Request  $request,$chatroomid)
    {
        list($name,$fileName,$myid) = BaseClass::look_myuser();
        // 相手の情報を取得
        $chatroomtalk =  \DB::table('chat')
        ->leftjoin('community','chat.chatroom','=','community.groupid')
        ->leftjoin('user','chat.user_id','=','user.userid')
        ->select('chat.chatroom','chat.id as id','user.name as user_name','user.userid as user_id','user.image as user_image','community.image as community_image','community.name as community_name','chat.message as message')
        ->where('chat.chatroom',$chatroomid)->whereNotNull('message')->orderBy('id', 'asc')->get();
---
select `chat`.`chatroom`, `chat`.`id` as `id`, `user`.`name` as `user_name`, `user`.`userid` as `user_id`, `user`.`image` as `user_image`, `community`.`image` as `community_image`, `community`.`name` as `community_name`, `chat`.`message` as `message` from `chat` left join `community` on `chat`.`chatroom` = `community`.`groupid` left join `user` on `chat`.`user_id` = `user`.`userid` where `chat`.`chatroom` = '241415922' and `message` is not null order by `id` asc

    public function chatcreate (Request  $request,$chatroomid)
    {
        list($name,$fileName,$myid) = BaseClass::look_myuser();
        // 相手の情報を取得
        $yourchat =  \App\Models\chat::where('chatroom' , $chatroomid)->where('user_id', $myid)->first();
        $userid = $yourchat->reply_id;
        list($item,$yourname,$yourimage) = BaseClass::look_youruser($userid);
        $message = $request->message;
        // メッセージ挿入
        $chat = new chat;
        $chat->chatroom = $chatroomid;
        $chat->user_id = $myid;
        $chat->reply_id = $userid;
        $chat->message = $message;
        $chat->save();

        event(new MessageCreated($message));
        // トーク履歴の呼び出し
        $chatroomtalk =  \DB::table('chat')
        ->leftjoin('community','chat.chatroom','=','community.groupid')
        ->leftjoin('user','chat.user_id','=','user.userid')
        ->select('chat.chatroom','user.name as user_name','user.userid as user_id','user.image as user_image','community.image as community_image','community.name as community_name','chat.message as message','chat.id as id')
        ->where('chat.chatroom',$chatroomid)->whereNotNull('message')->orderBy('id', 'asc')->get();
---
insert into `chat` (`chatroom`, `user_id`, `reply_id`, `message`, `updated_at`, `created_at`) values ('1445300679', 2034178332, 1309134703, 'kljdajpof', '2020-12-23 02:09:01', '2020-12-23 02:09:01')
select `chat`.`chatroom`, `user`.`name` as `user_name`, `user`.`userid` as `user_id`, `user`.`image` as `user_image`, `community`.`image` as `community_image`, `community`.`name` as `community_name`, `chat`.`message` as `message`, `chat`.`id` as `id` from `chat` left join `community` on `chat`.`chatroom` = `community`.`groupid` left join `user` on `chat`.`user_id` = `user`.`userid` where `chat`.`chatroom` = '1445300679' and `message` is not null order by `id` asc

    public function community (Request  $request)
    {
        list($name,$fileName,$myid) = BaseClass::look_myuser();
        if(isset($request->community_name))
        {
            // コミュニティ作成
            $community = new Community;
            $community->groupid = rand();
            $community->user_id= $myid;
            $community->member = 1;
            $community->name = $request->community_name;
            $file = $request->file('image');
            if($file->isValid()) {
                $fileNames = time() . $file->getClientOriginalName();
                $target_path = public_path('uploads');
                $file->move($target_path, $fileNames);
            }
            $community->image = $fileNames;
            $community->category = $request->community_category;
            $community->save();
---
insert into `community` (`groupid`, `user_id`, `member`, `name`, `image`, `category`, `updated_at`, `created_at`) values (241415922, 2034178332, 1, 241415922, '16081706914F51172B-1638-4EBD-9B63-77DC58076A1A_4_5005_c.jpeg', '音楽', '2020-12-17 04:15:23', '2020-12-17 04:15:23')

    public function communitydetail (Request  $request,$groupid)
    {
        list($name,$fileName,$myid) = BaseClass::look_myuser();
        // グループ情報
        $communities =  \App\Models\Community::where('groupid', $groupid)->first();
        // 自分が入っているかどうか
        $mygroupjoin =  \App\Models\Community::where('groupid', $groupid)->where('user_id', $myid)->first();
---
select * from `community` where `groupid` is null and `user_id` = 2034178332 limit 1

    public function community_join (Request  $request)
    {
        list($name,$fileName,$myid) = BaseClass::look_myuser();
        // 自分が入っているかどうか
        $mygroupjoin =  \App\Models\Community::where('groupid', $request->grouplike)->where('user_id', $myid)->first();
        $joingroup =  \App\Models\Community::where('groupid', $request->grouplike)->first();
        // グループ情報
        if(isset($mygroupjoin))
        {
            \App\Models\Community::where('groupid', $request->grouplike)->where('user_id', $myid)->delete();
        }
        else
        {
            // コミュニティ参加登録
            $community = new Community;
            $community->groupid = $joingroup->groupid;
            $community->user_id= $myid;
            $community->member += 1;
            $community->name = $joingroup->name;
            $file = $request->file('image');
            $community->image = $joingroup->image;
            $community->category = $joingroup->category;
            $community->save();
            // チャットルーム作成
            $chat = new chat;
            $chat->chatroom = $joingroup->groupid;
            $chat->user_id = $myid;
            $chat->reply_id = $joingroup->groupid;
            $chat->save();
---
select * from `community` where `groupid` = '2024245706' and `user_id` = 2034178332 limit 1
select * from `community` where `groupid` = '2024245706' limit 1
select * from `community` where `groupid` = '241415922' and `user_id` = 2034178332 limit 1
insert into `community` (`groupid`, `user_id`, `member`, `name`, `image`, `category`, `updated_at`, `created_at`) values (1777269087, 2034178332, 1, '水泳', '16086975378448649B-73DD-43F7-BE5D-B1240D842266_4_5005_c.jpeg', '音楽', '2020-12-23 04:27:23', '2020-12-23 04:27:23')
insert into `chat` (`chatroom`, `user_id`, `reply_id`, `updated_at`, `created_at`) values (1777269087, 2034178332, 1777269087, '2020-12-23 04:27:23', '2020-12-23 04:27:23')