app/Http/Controllers/TestController.php


            if(isset($insert['openness']))  {
                $id = session()->get('id');
                \DB::table('test')->where('id', $id) ->update([
                    'openness' => $sum
                ]);
---
update `test` set `openness` = 0 where `id` = 68


            if(isset($insert['extraversion']))  {
                $id = session()->get('id');
                \DB::table('test')->where('id', $id) ->update([
                    'extraversion' => $sum
                ]);
---
update `test` set `extraversion` = 0 where `id` = 70