app/Http/Controllers/UserloguinController.php

    public function  login(Request $request)
    {
        // ログインチェック
        if(Auth::check()) {
            $id = session()->get('id');
            $user =  \DB::table('user')->where('sessionid', $id)->first();
            $name= $user->name;
            $fileName= $user->image;
            $userid = $user->userid;
            $item = test::find($id);
            return view('person.mypage',compact('name','item','userid','fileName'));
        }
        else
        {
            $email = $request->login_mail;
            $password = $request->login_pass;
            if(isset($request->login_name))
            {
                if(empty($email) && empty($password)){
                    return redirect('person/loguin');

                }
                $id = session()->get('id');
                $loginuser = new loginuser;
                $loginuser->userid = rand();
                $loginuser->sessionid = $id;
                $loginuser->name = $request->login_name;
                $loginuser->password = Hash::make($request->login_pass);
                $loginuser->email = $request->login_mail;
                $loginuser->save();
---
insert into `user` (`userid`, `sessionid`, `name`, `password`, `email`, `updated_at`, `created_at`) values (391612223, '', 'nljhla', 'y$pncCI/7c2uDIxuqzhAKUte9swgdTQp73fpMxA8Ak6wc4QoqU6XkVC', 'ljiajfoja@icloud.com', '2020-12-29 02:07:03', '2020-12-29 02:07:03')

                if(session()->exists('id')) {
                    session()->flush();
                }
                $user =  \DB::table('user')->where('email', $email)->first();
---
select * from `user` where `email` = 'ljiajfoja@icloud.com' limit 1